In [1]:
from sklearn.decomposition import PCA
from sklearn.datasets import load_digits
%matplotlib inline
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns; sns.set()
import pandas as pd

import os

In [2]:
train = pd.read_csv('{}/aiffel/Case.csv'.format(os.getenv('HOME')))
#test = pd.read_csv('{}/aiffel/bike_sharing_demand_test.csv'.format(os.getenv('HOME')))
train.head()

,case_id,province,city,group,infection_case,confirmed,latitude,longitude
0,1000001,Seoul,Yongsan-gu,True,Itaewon Clubs,139,37.538621,126.992652
1,1000002,Seoul,Gwanak-gu,True,Richway,119,37.48208,126.901384
2,1000003,Seoul,Guro-gu,True,Guro-gu Call Center,95,37.508163,126.884387
3,1000004,Seoul,Yangcheon-gu,True,Yangcheon Table Tennis Club,43,37.546061,126.874209
4,1000005,Seoul,Dobong-gu,True,Day Care Center,43,37.679422,127.044374

In [3]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 174 entries, 0 to 173
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0    case_id        174 non-null    int64
 1   province        174 non-null    object
 2   city            174 non-null    object
 3   group           174 non-null    bool
 4   infection_case  174 non-null    object
 5   confirmed       174 non-null    int64
 6   latitude        174 non-null    object
 7   longitude       174 non-null    object
dtypes: bool(1), int64(2), object(5)
memory usage: 9.8+ KB

In [11]:
t1 = pd.DataFrame(train['confirmed'])

In [15]:
t1 = t1 *1000000

In [16]:
t1

     confirmed
0    139000000
1    119000000
2     95000000
3     43000000
4     43000000
..         ...
169   20000000
170   14000000
171          0
172    4000000
173    1000000

[174 rows x 1 columns]

In [12]:
t2 = pd.DataFrame(train['latitude'])

In [17]:
t2 = t2 *1000000

In [18]:
t2

                                              latitude
0    37.53862137.53862137.53862137.53862137.5386213...
1    37.4820837.4820837.4820837.4820837.4820837.482...
2    37.50816337.50816337.50816337.50816337.5081633...
3    37.54606137.54606137.54606137.54606137.5460613...
4    37.67942237.67942237.67942237.67942237.6794223...
..                                                 ...
169  ----------------------------------------------...
170  ----------------------------------------------...
171  ----------------------------------------------...
172  ----------------------------------------------...
173  ----------------------------------------------...

[174 rows x 1 columns]

In [13]:
t3 = pd.DataFrame(train['longitude'])

In [19]:
t3 = t3*1000000
t3

                                             longitude
0    126.992652126.992652126.992652126.992652126.99...
1    126.901384126.901384126.901384126.901384126.90...
2    126.884387126.884387126.884387126.884387126.88...
3    126.874209126.874209126.874209126.874209126.87...
4    127.044374127.044374127.044374127.044374127.04...
..                                                 ...
169  ----------------------------------------------...
170  ----------------------------------------------...
171  ----------------------------------------------...
172  ----------------------------------------------...
173  ----------------------------------------------...

[174 rows x 1 columns]

In [8]:
t1 = float(t1)

TypeError: float() argument must be a string or a number, not 'DataFrame'

In [5]:
t1 = float(t1)
t2 = float(train['latitude'])
t3 = float(train['longitude'])

TypeError: cannot convert the series to <class 'float'>

In [ ]:
fig = plt.figure(figsize=(20,10))
ax1 = fig.gca(projection = '3d')
ax1.scatter(t1,t2,t3)
ax1.view_init(20, 80)

/tmp/ipykernel_14/2236006220.py:2: MatplotlibDeprecationWarning: Calling gca() with keyword arguments was deprecated in Matplotlib 3.4. Starting two minor releases later, gca() will take no keyword arguments. The gca() function should only be used to get the current axes, or if no axes exist, create new axes with default keyword arguments. To create a new axes with non-default arguments, use plt.axes() or plt.subplot().
  ax1 = fig.gca(projection = '3d')